# 1 задача
#Три сопротивления R u R 2y R 3 соединены параллельно. Найти сопротивление соединения.

firstResistance = int(input("Введите значение R1: "))
secondResistance = int(input("Введите значение R2: "))
thirdResistance = int(input("Введите значение R3: "))










# 2 задача
# Даны три действительных числа. Выбрать из них
#те, которые принадлежат интервалу ( 1, 3).












# 3 задача
# Даны действительные числа а, Л, натуральное число я.
# Вычислить f (a) + 2/ (а + h) + 2/ (а + 2h) + ... + -2f(a + (n— l)h) + f(a + nh), где
# f(x) = (x^2 + 1) cos^2 x.